tutorial/the-limits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Limits of our Computer</title>
<!-- 2015-11-10 Tue 21:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Howard Abrams" />
</head>
<body>
<div id="content">
<h1 class="title">The Limits of our Computer</h1>
<p>
Erase your program and type the following (or, you can click the arrow
icon on the right side of the box below to automatically copy it into
the simulator):
</p>

<pre class="example">
260
</pre>

<p>
In this case, don't separate the numbers with spaces, as we're
playing around. Press the <b>Load</b> button, and our "program" places a
<code>4</code> in the first memory location and that is all.
</p>

<p>
<b>Why?</b>
</p>

<p>
Like early computers from the 1970's and 80's, our computer is limited
to numbers less than 256. A very odd number, but not if you think like
a computer.
</p>

<p>
Computers think in <a href="sub-binary.html">binary numbers</a>, so all numbers are based on <i>two</i>.
</p>

<p>
And:
</p>

<p>
2 x 2 x 2 x 2 x 2 x 2 x 2 x 2 = 256
</p>

<p>
That is 2 times itself <i>eight</i> times, or <i>two</i> to the power of
<i>eight</i>. We write this in math as 2<sup>8</sup>. You may have heard of 8-bit? No
matter, it was <a href="sub-early-limits.html">just a limitation of these early computers</a>.
</p>

<p>
<b>Why 4?</b>
</p>

<p>
You might think that putting 260 into a cell that can only hold
numbers less than 256 would leave 255, but computer cells <i>roll over</i>.
</p>

<p>
The computer fills the cell to <code>255</code>, but it still has more to go, so
it rolls back around to <code>0</code> for the 256, <code>1</code> for the 257, <code>2</code> for the
258 &#x2026; eventually leaving <code>4</code> in the memory cell location.
</p>

<p>
Before we move on, let's try out another problem. Let's put the
following program:
</p>

<pre class="example">
#A B #C
</pre>

<p>
When you press <b>Load</b>, you will see that our first memory cell has
<code>10</code>, the second has <code>0</code>, and the third has <code>12</code>. What is going on
here?
</p>

<p>
Well, the <code>B</code> is clearly not a number, so putting <code>0</code> in the second
memory location would be expected, but what about the <i>hashtags</i>?
</p>

<p>
<code>#A</code> is a number&#x2026; just not in our normal decimal format. It just
uses a base of 16, instead of 10. This is called <a href="sub-hexadecimal.html">hexadecimal</a>, and
since 16 is a power of two (2<sup>4</sup>), it is sometimes easier to use when
you are dealing with computers.
</p>

<p>
If you click the switch that shows: <b>Dec &lt;-&gt; Hex</b> below the <b>Step</b>
button, you will see all the numbers change between decimal (base 10)
and hexadecimal (base 16). Notice that the second strip of memory is
labeled <code>80</code> which seems a little nicer instead of the original
decimal value of <code>128</code>.
</p>

<p>
I think it is time to actually program this, so let's move to the next lesson.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2015 Nov 10</p>
<p class="author">Author: Howard Abrams</p>
<p class="date">Created: 2015-11-10 Tue 21:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.0.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
